#ifndef LCD_C
#define LCD_C
//インクルード----------------------------------------------------------------------------------------------------------------

#include"LCD.h"

//グローバル変数--------------------------------------------------------------------------------------------------------------

//動作関数--------------------------------------------------------------------------------------------------------------------

//コマンド送信関数

void lcd_CMD(unsigned char cmd){
	uint8_t Command[2] = { RSBIT0, cmd };
	I2C_LCD_CMD;

}

//データ送信関数

void lcd_DATE(unsigned char date){
	uint8_t word[2] = { RSBIT1, date };	
	I2C_LCD_SEND;
}
//遅延関数

void lcd_wait(int time){
	cnt_lcd = 0;
	while(time >= cnt_lcd){}
}

#endif