/****************************************************************************/
/* 対象マイコン R8C/38A                                                     */
/* ﾌｧｲﾙ内容     I2C液晶(コントローラ：ST7032i)　制御プログラム              */
/* バージョン   Ver.1.00                                                    */
/* Date         2014.01.03                                                  */
/* Copyright    ジャパンマイコンカーラリー実行委員会                        */
/****************************************************************************/

/*======================================*/
/* インクルード                         */
/*======================================*/
#include <stdio.h>
#include "sfr_r838a.h"                  /* R8C/38A SFRの定義ファイル    */
#include "lcd_st7032i_lib.h"            /* ST7032i(I2C)液晶表示ﾗｲﾌﾞﾗﾘ   */
/* 【注意】液晶を使うときは、ルネサス統合開発環境の「C source file」欄に
   「printf_lib.c」も追加してください。無い場合、ﾋﾞﾙﾄﾞ時にｴﾗｰになります */

/*======================================*/
/* シンボル定義                         */
/*======================================*/

/*======================================*/
/* プロトタイプ宣言                     */
/*======================================*/
void init( void );

/*======================================*/
/* グローバル変数の宣言                 */
/*======================================*/
unsigned long   cnt1;                   /* 1msごとに+1                  */

/************************************************************************/
/* メインプログラム                                                     */
/************************************************************************/
void main( void )
{
    /* マイコン機能の初期化 */
    init();                             /* 初期化                       */
    asm(" fset I ");                    /* 全体の割り込み許可           */
    initLcd();                          /* I2C液晶初期化                */

    lcdContrast( 30 );                  /* コントラスト(濃さ)の設定0～63*/

    lcdPosition( 0, 0 );
    lcdPrintf( "time = " );
    while( 1 ) {
        lcdPosition( 0, 1 );
        lcdPrintf( "%08ld", cnt1 );

        p4_5 = (cnt1 / 500 ) & 0x1;     /* マイコンボードのLEDを点滅    */
    }
}

/************************************************************************/
/* R8C/38A スペシャルファンクションレジスタ(SFR)の初期化                */
/************************************************************************/
void init( void )
{
    int i;

    /* クロックをXINクロック(20MHz)に変更 */
    prc0  = 1;                          /* プロテクト解除               */
    cm13  = 1;                          /* P4_6,P4_7をXIN-XOUT端子にする*/
    cm05  = 0;                          /* XINクロック発振              */
    for(i=0; i<50; i++ );               /* 安定するまで少し待つ(約10ms) */
    ocd2  = 0;                          /* システムクロックをXINにする  */
    prc0  = 0;                          /* プロテクトON                 */

    /* ポートの入出力設定 */
    prc2 = 1;                           /* PD0のプロテクト解除          */
    pd0 = 0x00;                         /* 7-0:センサ基板Ver.4.1        */
    pd1 = 0xd0;                         /* 5:RXD0 4:TXD0 3-0:DIP SW     */
    p2  = 0xc0;
    pd2 = 0xfe;                         /* 7-0:モータドライブ基板Ver.4  */
    pd3 = 0xff;                         /*                              */
    p4  = 0x20;                         /* P4_5のLED:初期は点灯         */
    pd4 = 0xb8;                         /* 7:XOUT 6:XIN 5:LED 2:VREF    */
    pd5 = 0x5f;                         /* 7-0:LCD/microSD基板          */
    pd6 = 0xef;                         /* 4-0:LCD/microSD基板          */
    pd7 = 0xff;                         /*                              */
    pd8 = 0xff;                         /*                              */
    pd9 = 0x3f;                         /*                              */
    pur0 = 0x04;                        /* P1_3～P1_0のプルアップON     */

    /* タイマRBの設定 */
    /* 割り込み周期 = 1 / 20[MHz]   * (TRBPRE+1) * (TRBPR+1)
                    = 1 / (20*10^6) * 200        * 100
                    = 0.001[s] = 1[ms]
    */
    trbmr  = 0x00;                      /* 動作モード、分周比設定       */
    trbpre = 200-1;                     /* プリスケーラレジスタ         */
    trbpr  = 100-1;                     /* プライマリレジスタ           */
    trbic  = 0x07;                      /* 割り込み優先レベル設定       */
    trbcr  = 0x01;                      /* カウント開始                 */
}

/************************************************************************/
/* タイマRB 割り込み処理                                                */
/************************************************************************/
#pragma interrupt intTRB(vect=24)
void intTRB( void )
{
    cnt1++;

    /* LCD表示処理用関数(1msごとに実行)     */
    lcdShowProcess();
}

/************************************************************************/
/* end of file                                                          */
/************************************************************************/
